// How to use array method to develop todo application

// array method 
// 1. forEach 
// 2. map 
// 3. filter 

// 1. forEach
// 원본(배열)을 변경한다.
// for문과 동일하다고 볼 수 있다.

// 어떤 기능을 개발할 때 주로 사용할까?
// 값(배열)을 바꿀 때는 사용하지 말고, 그 값을 활용하여 무엇인가를 할 때 사용한다.


// 2. map
// 원본 배열을 변경하지 않고, 새로운 배열을 생성하여 반환한다.
// 요소값을 다른 값으로 맵핑하기 위한 함수이다.
// 매핑한다: 1:1 대응한다.(원본이 3개면, 반환값도 3개이다.)

// 어떤 기능을 개발할 때 주로 사용할까?


// 3. filter
// 원본 배열을 변경하지 않고, 콜백함수의 실행 결과가 true인 배열 요소의 값만을 추출한 새로운 배열을 생성하여 반환한다.

// 어떤 기능을 개발할 때 주로 사용할까?
// 체크한 버튼만 골라서, 삭제할 때